{
	"version": "1.0.0",
  "introScene": [
    "Welcome to Pigeonburgh. A city full of opportunity and corn chips.",
    "It's the year 2087, and a technocracy has deployed a fleet of automated multi-purpose robots called X-Mechs.",
    "Anything you can think of to order, the X-Mechs deliver within two hours right to your doorstep...",
    "..or window or balcony!",
    "Convenient, indeed.",
    "The flight delivery upgrade was a crowd favorite among the high-rise apartment dwellers of Pigeonburgh.",
    "Outside of speedy delivery, the X-Mechs also keep the peace. Keep it real good.",
    "It's a saftey subscription service no one can opt-out of.",
    "Oh don't worry, it's fine for the most part. Just don't commit any crimes or accidentally litter.",
    "Anyways.",
    "You are a city pigeon named Pip in your prime. How coo is that? You reckon it's pretty coo.",
    "Yawwwwn. You wake up in your apartment on the North side of Pigeonburgh.",
    "You remember you might have work today...",
    "Ugh. Your bird brain isn't reliable. Better check the schedule, boss always posts it online.",
    "And so it begins."
  ],
  "storyline": [
    {
      "interactiveName": "computer",
      "hasSelection": false,
			"content": [
        {
          "mainText": [
            "It's your computer.",
            "Hey - no time to play Nest of Birdcraft!",
            "Check your work schedule. Boss always posts it online last minute."
          ]
        }
			]
    },
    {
      "interactiveName": "bed",
      "hasSelection": false,
      "content": [
        {
          "mainText": [
            "Yo, you just woke up. Save those Zzz's for later.",
            "Anyways, don't you have somewhere else to be?"
          ]
        }
      ]
    },
    {
      "interactiveName": "fridge",
      "hasSelection": true,
      "content": [
        {
          "mainText": [
            "Yawwwn. You check the fridge. Time for breaky.",
            "That's short for breakfast."
          ]
        },
        {
          "selection": {
            "mainText": "What do you want for breaky?",
            "options": [
              {
                "id": 1,
                "optionText": "Classic corn chips",
                "followUpText": [
                  "you selected corn chip"
                ]
              },
              {
                "id": 2,
                "optionText": "Coffee",
                "followUpText": [
                  "you selected coffee"
                ]
              }
            ]
          }
        }
      ]
    }
  ]
}